case_directories/case_uMF/0/air/Tambient
(
( 0 300.6500000 )
( 3600 300.0944444 )
( 7200 299.2611111 )
( 10800 298.7055556 )
( 14400 298.1500000 )
( 18000 297.0388889 )
( 21600 296.7611111 )
( 25200 296.4833333 )
( 28800 295.6500000 )
( 32400 294.8166667 )
( 36000 294.5388889 )
( 39600 295.3722222 )
( 43200 297.3166667 )
( 46800 299.5388889 )
( 50400 302.3166667 )
( 54000 303.7055556 )
( 57600 305.6500000 )
( 61200 306.2055556 )
( 64800 306.7611111 )
( 68400 307.5944444 )
( 72000 307.0388889 )
( 75600 307.0388889 )
( 79200 306.4833333 )
( 82800 304.8166667 )
( 86400 304.8166667 )
);
