case_directories/case_uMF/0/air/cloudCover
(
( 0 0 )
( 3600 0 )
( 7200 0 )
( 10800 0 )
( 14400 0 )
( 18000 0 )
( 21600 0 )
( 25200 0 )
( 28800 0 )
( 32400 0 )
( 36000 0 )
( 39600 0 )
( 43200 0 )
( 46800 0 )
( 50400 0 )
( 54000 0 )
( 57600 0 )
( 61200 0 )
( 64800 0 )
( 68400 0 )
( 72000 0 )
( 75600 0 )
( 79200 0 )
( 82800 0 )
( 86400 0 )
)



