case_directories/case_uMF/0/air/include/epsilon_bc_air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

#include    "ABLConditions"

type turbulentMixingLengthDissipationRateInlet;
mixingLength    $mixingLength;


// ************************************************************************* //
