case_directories/case_uMF/0/air/include/k_bc_air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/


#include    "ABLConditions"

type turbulentIntensityKineticEnergyInlet;
intensity       $intensityInlet;


// ************************************************************************* //
