case_directories/case_uMF/0/air/include/w_bc_air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            uniformFixedValue;
uniformValue    tableFile;
uniformValueCoeffs
{
    file        "$FOAM_CASE/0/air/wambient";
}
value           uniform 0.014042012;

// ************************************************************************* //
