case_directories/case_uMF/0/air/qs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      qs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            solarLoadRadiationViewFactor;
        albedoMode      lookup;
        albedo          uniform 0.1;
        qso             uniform 0;
        value           uniform 0;
    }
    outlet
    {
        type            solarLoadRadiationViewFactor;
        albedoMode      lookup;
        albedo          uniform 0.1;
        qso             uniform 0;
        value           uniform 0;
    }
    top
    {
         type            solarLoadRadiationViewFactor;
        albedoMode      lookup;
        albedo          uniform 0.1;
        qso             uniform 0;
        value           uniform 0;
    }
    terrain
    {
        type            solarLoadRadiationViewFactor;
        albedoMode      lookup;
        albedo          uniform 0.4;
        qso             uniform 0;
        value           uniform 0;
    }
    vegetation
    {
        type            solarLoadRadiationViewFactor;
        albedoMode      lookup;
        albedo          uniform 0.4;
        qso             uniform 0;
        value           uniform 0;
    }
    side1
    {
        type            solarLoadRadiationViewFactor;
        albedoMode      lookup;
        albedo          uniform 0.1;
        qso             uniform 0;
        value           uniform 0;
    }
    side2
    {
        type            solarLoadRadiationViewFactor;
        albedoMode      lookup;
        albedo          uniform 0.1;
        qso             uniform 0;
        value           uniform 0;
    }
    buildings
    {
        type            solarLoadRadiationViewFactor;
        albedoMode      lookup;
        albedo          uniform 0.4;
        qso             uniform 0;
        value           uniform 0;;
    }
}


// ************************************************************************* //
