case_directories/case_uMF/0/air/wambient
(
( 0 0.013316194 )
( 3600 0.013565965 )
( 7200 0.013565965 )
( 10800 0.013565965 )
( 14400 0.013565965 )
( 18000 0.013792242 )
( 21600 0.013792242 )
( 25200 0.013550379 )
( 28800 0.013316194 )
( 32400 0.013792242 )
( 36000 0.013550379 )
( 39600 0.013792242 )
( 43200 0.014042012 )
( 46800 0.014042012 )
( 50400 0.014807608 )
( 54000 0.014549695 )
( 57600 0.014042012 )
( 61200 0.014042012 )
( 64800 0.014549695 )
( 68400 0.014549695 )
( 72000 0.013800149 )
( 75600 0.014291783 )
( 79200 0.013800149 )
( 82800 0.013800149 )
( 86400 0.013800149 )
);

