case_directories/case_uMF/0/air/wind_direction
(
( 0 57.2000 )
( 3600 65.6000 )
( 7200 114.4444 )
( 10800 120.7692 )
( 14400 150.7143 )
( 18000 170.0000 )
( 21600 164.0000 )
( 25200 182.5000 )
( 28800 0.0000 )
( 32400 156.6667 )
( 36000 160.0000 )
( 39600 155.0000 )
( 43200 148.3333 )
( 46800 157.0833 )
( 50400 202.4000 )
( 54000 263.3333 )
( 57600 278.5714 )
( 61200 245.7143 )
( 64800 234.5000 )
( 68400 236.8182 )
( 72000 253.2000 )
( 75600 252.5000 )
( 79200 256.0870 )
( 82800 274.2308 )
( 86400 274.2308 )
);