case_directories/case_uMF/0/terrain/Ts
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "46800/terrain";
    object      Ts;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 302.1;

boundaryField
{
    sides
    {
        type            zeroGradient;
    }
    terrain_to_air
    {
        type            compressible::CFDHAMsolidTemperatureCoupledMixed;
        qrNbr           qr;
        qsNbr           qs;
        value           uniform 302.1;
    }
    interior
    {
        type            externalWallHeatFluxTemperature;
        mode            coefficient;
        kappaMethod     lookup;
        kappa           lambda_m;
        alphaAni        Anialpha;
        h               uniform 0.405;
        Ta              uniform 293.15;
        qr              none;
        refValue        uniform 302.1;
        refGradient     uniform 0;
        valueFraction   uniform 1;
        value           uniform 302.1;
    }
}


// ************************************************************************* //
