case_directories/case_uMF/0/terrain/ws
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "46800/terrain";
    object      ws;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 2.5;

boundaryField
{
    sides
    {
        type            zeroGradient;
    }
    terrain_to_air
    {
        type            zeroGradient;
    }
    interior
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
