case_directories/case_uMF/constant/IDN
(
( 0 0.0 )
( 3600 0.0 )
( 7200 0.0 )
( 10800 0.0 )
( 14400 0.0 )
( 18000 0.0 )
( 21600 0.0 )
( 25200 5.2125 )
( 28800 5.0519 )
( 32400 7.4328 )
( 36000 9.8015 )
( 39600 11.2328 )
( 43200 11.8649 )
( 46800 12.1473 )
( 50400 11.8433 )
( 54000 10.9052 )
( 57600 9.1407 )
( 61200 6.7422 )
( 64800 2.8696 )
( 68400 4.5039 )
( 72000 0.0 )
( 75600 0.0 )
( 79200 0.0 )
( 82800 0.0 )
( 86400 0.0 )
)
