case_directories/case_uMF/constant/Idif
(
( 0 0.0 )
( 3600 0.0 )
( 7200 0.0 )
( 10800 0.0 )
( 14400 0.0 )
( 18000 0.0 )
( 21600 0.0 )
( 25200 37.296 )
( 28800 89.3404 )
( 32400 160.2341 )
( 36000 222.5568 )
( 39600 268.3469 )
( 43200 295.0584 )
( 46800 302.6088 )
( 50400 289.2677 )
( 54000 255.9395 )
( 57600 204.3946 )
( 61200 138.9484 )
( 64800 55.2303 )
( 68400 18.6728 )
( 72000 0.0 )
( 75600 0.0 )
( 79200 0.0 )
( 82800 0.0 )
( 86400 0.0 )
)