case_directories/case_uMF/constant/buildings/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

buildingMaterials
(
    {
        name    FacadesRoofs;
        buildingMaterialModel Hamstad5Brick;
        rho     1600;
        cap     1000;
        lambda1    0.682;    //lambda = lambda1 + ws*lambda2
        lambda2    0;
    }   
);

// ************************************************************************* //
