case_directories/case_uMF/constant/sunPosVector
(
( 0 ( -0.1080994400 0.7658604314 -0.6338551181 ) )
( 3600 ( 0.1490689745 0.7621980500 -0.6299464846 ) )
( 7200 ( 0.3960979305 0.7154692787 -0.5755085931 ) )
( 10800 ( 0.6161457209 0.6288425320 -0.4742589172 ) )
( 14400 ( 0.7942080568 0.5082063366 -0.3331064124 ) )
( 18000 ( 0.9181409987 0.3617683554 -0.1616810549 ) )
( 21600 ( 0.9793281067 0.1994634889 0.0336270136 ) )
( 25200 ( 0.9737899167 0.0324296298 0.2251255588 ) )
( 28800 ( 0.9019648940 -0.1279911656 0.4124046453 ) )
( 32400 ( 0.7686420096 -0.2708968797 0.5794862739 ) )
( 36000 ( 0.5829002424 -0.3865556791 0.7147041447 ) )
( 39600 ( 0.3573978485 -0.4670917591 0.8087595851 ) )
( 43200 ( 0.1075064664 -0.5070233173 0.8552015642 ) )
( 46800 ( -0.1497372969 -0.5036368209 0.8508399935 ) )
( 50400 ( -0.3967937657 -0.4571725137 0.7959572854 ) )
( 54000 ( -0.6168166442 -0.3708082706 0.6942898918 ) )
( 57600 ( -0.7948021490 -0.2504429187 0.5527819537 ) )
( 61200 ( -0.9186128532 -0.1042939758 0.3811472059 ) )
( 64800 ( -0.9798103723 0.0576635862 0.1914328737 ) )
( 68400 ( -0.9744825541 0.2244403867 0.0032038340 ) )
( 72000 ( -0.9024201039 0.3845677151 -0.1942823423 ) )
( 75600 ( -0.7688400157 0.5271395038 -0.3619516180 ) )
( 79200 ( -0.5828324741 0.6424186465 -0.4975988241 ) )
( 82800 ( -0.3570747100 0.7225310013 -0.5919853070 ) )
)
