case_directories/case_uMF/system/air/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitT
{
    type            limitTemperature;

    selectionMode   all;

    min             273.15;
    max             350.15;
}

porosity1                                                                    
{                                                                               
    type            explicitPorositySource;                                     
                                                                                
    explicitPorositySourceCoeffs                                                
    {                                                                           
        selectionMode   cellZone;                                               
        cellZone        windbreakercell;                                                   
                                                                                
        type            DarcyForchheimer;                                       
                                                                                
        f   (0.6 0.6 0.6);                                                     
        d   (0 0 0);                                                    
                                                                                
        coordinateSystem                                                        
        {                                                                       
            type    cartesian;                                                  
            origin  (0 0 0);                                                    
            coordinateRotation                                                  
            {                                                                   
                type    axesRotation;                                           
                e1  (-0.39 0.92 0);
                e2  (0.92 0.39 0);                                                   
            }                                                                   
        }                                                                       
    }                                                                           
}    

// ************************************************************************* //
