case_directories/case_uMF/system/buildings/setset.batch
cellSet FacadesRoofs new boxToCell (-500 -400 240) (500 400 400)
cellZoneSet FacadesRoofs new setToCellZone FacadesRoofs
