case_directories/case_uMF/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"
// Where to load it from
libs            ("libsampling.so");

type            probes;

// Name of the directory for probe data
name            probes;

// Write at same frequency as fields
writeControl    timeStep;
writeInterval   1;  

fields (U T k epsilon p_rgh);
region air;

probeLocations
(

    (-17.39 -22.35 296.81)  // Station 1
    (-9.00 24.34 295.34)  // Station 2
    (69.44 37.12 290.5)  // Station 3
    (36.57 -61.00 295.7)  // Station 4



    // random points inside box1
    (-129.54 -232.25 322.79)
    (384.99 301.95 251.72)
    (189.67 17.58 261.59)
    (70.60 189.07 355.48)
    (-324.68 541.38 318.26)
    (-324.70 -39.87 242.17)
    (-412.13 102.37 253.93)
    (309.50 407.15 325.53)
    (72.80 -57.97 241.64)
    (168.31 -192.03 261.49)
    (-445.62 -4.15 310.91)
    (402.13 -117.64 329.15)
    (279.37 560.92 324.06)
    (-274.38 453.57 269.57)
    (-301.63 299.30 331.73)
    (-300.22 509.50 271.23)
    (-192.31 449.64 282.46)
    (4.61 -95.26 336.10)
    (-78.27 528.13 323.76)
    (-203.93 216.24 349.19)
    (82.38 452.97 324.78)
    (-339.43 531.25 313.40)
    (-203.11 20.80 252.93)
    (-136.84 -162.82 287.85)
    (-56.73 -58.73 274.79)
    (237.16 117.14 272.08)
    (-285.69 462.31 364.96)
    (-4.79 500.03 291.08)
    (65.03 -253.86 354.65)
    (-422.52 190.99 321.41)
    (78.54 108.57 342.26)
    (-311.72 -63.88 305.04)
    (-405.91 -154.16 314.50)
    (383.35 38.11 303.75)
    (398.31 572.59 265.87)
    (257.90 25.39 333.04)
    (-191.98 198.09 276.77)
    (-376.78 360.77 244.10)
    (147.02 61.08 323.23)
    (-70.94 598.08 263.56)
    (-355.02 589.84 360.81)
    (-21.81 -37.68 362.53)
    (-433.29 179.07 357.55)
    (348.02 5.68 288.16)
    (-232.91 -8.49 242.97)
    (127.63 -227.43 359.27)
    (-185.64 278.25 295.55)
    (0.42 183.87 364.15)
    (24.21 -214.54 363.77)
    (-298.92 -13.96 349.67)
    (401.84 542.00 278.51)
    (228.19 -48.47 290.06)
    (374.97 -132.06 349.43)
    (335.08 172.19 281.38)
    (69.92 610.33 262.59)
    (359.23 -46.27 311.94)
    (-384.98 333.50 360.27)
    (-288.99 412.51 329.67)
    (-423.61 -50.17 313.63)
    (-173.48 383.02 253.38)
    (-116.91 64.75 319.35)
    (-221.69 298.33 367.13)
    (276.06 299.41 258.85)
    (-145.42 213.09 307.04)
    (-213.13 -180.27 352.78)
    (20.63 477.57 335.37)
    (-338.15 23.25 329.80)
    (252.36 -95.30 330.50)
    (-397.43 -224.00 286.80)
    (417.29 261.76 278.40)
    (225.61 338.29 344.11)
    (-286.55 -245.35 344.21)
    (-459.07 192.18 351.47)
    (264.21 -60.00 357.35)
    (167.22 309.69 306.15)
    (187.00 -106.03 304.89)
    (224.74 350.10 342.70)
    (-397.88 81.49 323.81)
    (-143.89 567.13 330.43)
    (-360.53 -138.57 342.38)
    (306.75 41.16 354.39)
    (92.61 -159.80 284.06)
    (-168.51 556.50 288.85)
    (-407.24 514.69 252.97)
    (-186.29 -32.24 314.67)
    (-173.61 322.77 245.58)
    (187.54 461.61 300.32)
    (105.34 230.24 310.13)
    (328.28 207.68 277.51)
    (-42.31 -46.44 316.27)
    (-357.20 -177.79 244.89)
    (172.93 532.24 245.76)
    (215.38 535.07 345.80)
    (37.22 299.03 286.89)
    (224.47 39.36 257.19)
    (-23.04 48.35 307.53)
    (2.80 381.02 339.10)
    (-82.21 532.15 268.50)
    (-441.30 523.30 320.36)
    (-367.65 428.63 251.87)
  
);

// ************************************************************************* //
