case_directories/case_uMF/system/setset.batch
cellSet terrain new boxToCell (-2582 -2582 230) (2582 2582 340)
cellZoneSet terrain new setToCellZone terrain
