case_directories/case_uMF/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;
snap            on;
addLayers       on;

geometry
{
    buildings
    {
        type triSurfaceMesh;
        file "Mesh_Buildings.obj";
    }

    terrain
    {
        file "Mesh_Terrain.obj";
        type triSurfaceMesh;
    }
    windbreaker
    {
        type		triSurfaceMesh;
        file		"Mesh_Trees.obj";
    }
    
    // vegetation
    // {
    //     file "Mesh_Vegetation.obj";
    //     type triSurfaceMesh;
    // }

    refinementBox
    {
        type searchableBox;
        min (-400 -218 250);
        max (370 350 360);
    }
};

castellatedMeshControls
{
    minRefinementCells 0;
    nCellsBetweenLevels 1;//2;
    features
    (
      { file  "Mesh_Buildings.eMesh"; level 5; }

    );

    refinementSurfaces
    {
        buildings
        {
            level (3 5);
            patchInfo { type wall; }
        }
        // vegetation
        // {
        //     level (2 3);
        //     patchInfo { type wall; }
        // }
        windbreaker
        {
            level		(2 3);
            faceZone windbreakerface;
            cellZone windbreakercell;
            cellZoneInside inside;
        }

        terrain
        {
            level (2 3);
            patchInfo { type wall; }
        }
    }

    refinementRegions
    {
        refinementBox
        {
            mode inside;
            levels ((1E15 2));
        }
        buildings
        {
            mode distance;
            levels ((3.0 4)(6.0 3));   
        }
        terrain
            {
            mode distance;
            levels ((2.0 3)(3.0 2));
            }

        // vegetation
        //     {
        //     mode distance;
        //     levels ((1.0 3)(3.0 2));
        //     }
    }

    locationInMesh (0 0 300);

    resolveFeatureAngle 5;
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 80;
    nRelaxIter 8;

    nFeatureSnapIter 20;

    explicitFeatureSnap    true;
    implicitFeatureSnap    false;
}




addLayersControls
{
    layers
    {
        buildings
        {
            nSurfaceLayers 3;//1;
        }
        terrain
        {
            nSurfaceLayers 3;//1;
        }

    }

    relativeSizes       false;
    expansionRatio      1.2;
    firstLayerThickness 0.15;
    minThickness        1e-3;
    
    nGrow 0;
    featureAngle 30;//60;
    slipFeatureAngle 30;
    nRelaxIter 8;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 10;
}

meshQualityControls
{}

writeFlags
(
    noRefinement
    scalarLevels
    layerSets
    layerFields
);

mergeTolerance 1e-6;

// ************************************************************************* //
